Public Attributes | List of all members
API_UCCallbackType Struct Reference
Dialog and Palette integration
Describes the attribute set to be used in a user control dialog item. More...
#include <APIdefs_Interface.h>
 Public Attributes
 API_UserControlType  | type
The attribute set to be used.
 short  | dialogID
The identifier of the dialog or tab page.
 short  | itemID
The dialog item identifier.
Detailed Description
Describes the attribute set to be used in a user control dialog item.
Remarks
This structure is used in the ACAPI_Dialog_SetUserControlCallback (...) function.